//
//  main.cpp
//  fat32shell
//
//  Created by 15803450188 on 2019/12/20.
//  Copyright © 2019 zy. All rights reserved.
//

#include <stdio.h>
#include <string.h>
#include <unistd.h>
#include <pwd.h>
#include <stddef.h>
#include <ctype.h>
#include <vector>
#include <iostream>
#include <stdlib.h>
#include <sys/wait.h>
#include <stdint.h>
#include <inttypes.h>

using namespace std;

char curdir[256];
char username[256];
char curname[256];
char prompt[512] = "";

// shell 分割输入
void SplitInput(const string &s, vector<string> &v, const string &c)
{
    size_t pos1, pos2;
    pos2 = s.find(c);
    pos1 = 0;
    size_t npos = -1;
    while (npos != pos2)
    {
        if (pos1 != pos2)
            v.push_back(s.substr(pos1, pos2 - pos1));
        pos1 = pos2 + c.size();
        pos2 = s.find(c, pos1);
    }
    if (pos1 != s.length())
        v.push_back(s.substr(pos1));
}
// 检查用户信息
int checklogin(char *aoUserPara)
{
    uid_t uid = getuid();

    char *LoginId;
    struct passwd *pwdinfo = getpwuid(uid);
    if (aoUserPara == NULL)
        return -9;
    if ((LoginId = getlogin()) == NULL)
    {
        perror("getlogin");
        aoUserPara[0] = '\0';
        return -8;
    }
    if ((pwdinfo = getpwnam(LoginId)) == NULL)
    {
        perror("getpwnam");
        return -7;
    }
    return 0;
}

// get user default dir
int getuserdir(char *aoUserDir)
{
    uid_t uid = getuid();
    struct passwd *pwdinfo = getpwuid(uid);
    int check = checklogin(aoUserDir);
    if (check != 0)
    {
        return check;
    }

    strcpy(aoUserDir, pwdinfo->pw_dir);
    return 0;
}

// get user name
int getusername(char *aoUserName)
{
    int check = checklogin(aoUserName);
    if (check != 0)
    {
        return check;
    }
    strcpy(aoUserName, getlogin());
    return 0;
}

// get current dir
int getusercwd(char *aoUserCwd)
{
    char buf[256];
    getcwd(buf, sizeof(buf));
    strcpy(aoUserCwd, buf);
    return 0;
}

// get current dir name
int getcurname(char *curname)
{
    char *dir = curdir;
    if (dir == NULL)
    {
        return -9;
    }
    size_t len = strlen(dir);
    int j = 0;
    for (j = len - 1; j > 0; j--)
    {
        if (dir[j] == '/')
        {
            j++;
            for (int i = 0; j < len; i++)
            {
                curname[i] = dir[j];
                j++;
            }
            return 0;
        }
    }
    if (j == 0)
    {
        curname = dir;
    }
    return 0;
}

// change dir
int chuserdir(char *newDir)
{
    int cd = chdir(newDir);
    return cd;
}
// 初始化prompt
void initprompt()
{
    memset(username, 0, sizeof(username));
    memset(curdir, 0, sizeof(curdir));
    memset(curname, 0, sizeof(curname));
    getusername(username);
    getusercwd(curdir);
    getcurname(curname);
    memset(prompt, 0, sizeof(prompt));
    strcat(prompt, "[");
    strcat(prompt, username);
    strcat(prompt, " ");
    strcat(prompt, curname);
    strcat(prompt, "]$");
}

// initialize global vars
void initshell()
{
    chdir("/mnt");
    getusername(username);
    getusercwd(curdir);
    getcurname(curname);
    initprompt();
    printf("**************welcome to ruby's mini shell**************\n");
}

struct VolumeLabel11
{
    uint32_t Bytes4;
    uint32_t Bytes8;
    uint16_t Bytes10;
    uint8_t Bytes11;
};
// DBR的一些属性 分区引导扇区
struct DosBootRecord
{
    uint32_t BootJmp;                 // 0跳转指令
    uint32_t OemName[2];              // 3文件系统标志和版本号
    uint16_t BytesPerSector;          // 11每扇区字节数
    uint8_t SectorPerCluster;         // 13每簇扇区数
    uint16_t ReservedSectorCount;     // 14保留扇区数
    uint8_t FATsCount;                // 16FAT表个数
    uint16_t RootDirCount16;          // 17根目录中目录个数
    uint16_t TotalSectorCount16;      // 19总扇区数
    uint8_t MediaType;                // 21存储介质
    uint16_t SectorPerFAT16;          // 22一个FAT表所占的扇区数
    uint16_t SectorPerTrack;          // 24
    uint16_t HeadSideCount;           // 26
    uint32_t HiddenSectorCount;       // 28
    uint32_t SectorCount;             // 32
    uint32_t SectorPerFAT32;          // 36
    uint16_t Flag32;                  // 40
    uint16_t FATVersion;              // 42
    uint32_t RootFirstCluster;        // 44
    uint16_t FSInfoSector;            // 48
    uint16_t BackupBSSector;          // 50
    uint32_t FATExtend[3];            // 52
    uint8_t DriveNumber1;             // 64
    uint8_t DriveNumber2;             // 65
    uint8_t ExtendBootFlag;           // 66
    uint32_t VolumeAlignment;         // 67
    struct VolumeLabel11 VolumeLabel; // 71
    uint32_t FSFormat[2];             // 82
    uint16_t SignatureFlag;           // 510
} DBR;

// 文件系统信息扇区
struct FSINFO
{
    uint32_t ExtendBootFlag;       // 512
    uint32_t FSINFOSignature;      // 996
    uint32_t NextAvailableCluster; // 1004
    uint16_t Flag55AA;             // 1022

} FSINFO;

// FAT32的一些参数 文件分配表
struct FileAllocationTable32
{
    uint32_t FAT1Offset;          // FAT1 偏移量
    uint32_t FAT2Offset;          // FAT2 偏移量
    uint32_t RootDirectoryOffset; // 根目录偏移量
    uint32_t BytesPerCluster;     // 每簇字节数
    uint32_t DirItemPerCluster;   // 每簇目录项
} FAT32;

// 存储目录项的结构体
typedef struct DirectoryInfo
{
    uint8_t LongDirOrder; // 长目录项顺序
    uint8_t *Name;
    uint8_t Attribute;
    uint32_t Cluster;
    uint32_t Size;
    uint16_t CreateTime;
    uint16_t CreateDate;
    uint16_t LastVisitDate;
    uint16_t LastModifyTime;
    uint16_t LastModifyDate;
} DirectoryInfo;

// 打印DBR属性
void printDBR()
{
    printf("\nDBR Attributes info:\n");
    printf("-----------------------------------------------------------\n");
    printf("DosBootRecordAttribute   Value\n");
    printf("-----------------------------------------------------------\n");
    printf(" BootJmp                 %d\n", DBR.BootJmp);
